namespace SharedLibrary.GlobalEnums
{
    ///////////////////////////////////////////////////////////////////////////////////
    //Коды команд для оповещения (передаваеме по цепочке UI - Main - ЛО)
    ///////////////////////////////////////////////////////////////////////////////////
    public enum NotificationCodes
    {
        START_NOTIFY = 1,    //запустить оповещение
        SHUTDOWN_NOTIFY = 2, //прервать оповещение
        RENOTIFY = 3,        //дооповестить
        REINIT = 4,          //изменились параметры настройки
        SHUTDOWN_COMMAND = 4 //принудительная команда на прерывание оповещения
    }
}
